cases/2D_axisymmetric_reacting_jet/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2012 / v2206 / v2312
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.233;

boundaryField
{
    fuelInlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    coflowInlet
    {
        type            fixedValue;
        value           uniform 0.233; // Atmospheric air oxygen mass fraction
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.233;
        value           uniform 0.233;
    }

    axis
    {
        type            symmetryPlane;
    }

    outerWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
