cases/2D_axisymmetric_reacting_jet/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2012 / v2206 / v2312
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    fuelInlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05; // 5% turbulence intensity
        value           uniform 0.1;
    }

    coflowInlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.02; // 2% turbulence intensity
        value           uniform 0.01;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }

    axis
    {
        type            symmetryPlane;
    }

    outerWall
    {
        type            kLowReWallFunction;
        value           uniform 1e-10;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
